### 命名规则

 Rust 命名规则的基本指导原则：

1. 变量和函数名: 通常使用小写字母，并使用下划线分隔单词，例如 `my_variable` 和 `print_hello`。
2. 常量名: 使用全大写字母，并使用下划线分隔单词，例如 `PI` 和 `MAX_VALUE`。
3. 类型名: 使用驼峰命名法，首字母大写，例如 `MyStruct` 和 `MyEnum`。
4. 模块名和文件名: 使用小写字母，并使用下划线分隔单词。模块名和文件名通常保持一致，例如模块 `my_module` 对应的文件名为 `my_module.rs`。
5. 泛型参数: 通常使用大写字母表示，例如 `T` 和 `U`。在类型名称中，泛型参数通常紧跟在类型名称之后，例如 `Vec<T>`。
6. 生命周期参数: 生命周期参数的名称通常以 `'` 开头，后面跟一个小写字母，例如 `'a` 和 `'b`。
7. 宏名: 宏名使用小写字母，并使用下划线分隔单词。与函数名类似，但在宏名后加感叹号以表示宏，例如 `my_macro!`。

请注意，这些规则并非强制性的，但遵循这些惯例将有助于保持代码的一致性和可读性。
